org/roadmap.org
#+TITLE: APISnoop 1.19 OKRs
#+AUTHOR: ii.coop

* v1.19
Our goal is to not make radical changes to process or approach, but iterate on our working methods to increase velocity and output in a stable, consistent way.
** June News
*** SIG-Release 1.19 [[https://github.com/kubernetes/sig-release/tree/master/releases/release-1.19#timeline][Timelines]] due to Covid
- Dates [[https://groups.google.com/forum/?utm_medium=email&utm_source=footer#!msg/kubernetes-dev/TVXhcNO3SPU/-Uj-xJP2BQAJ][may yet again slip]], not confirmed
- Tests need to be in Week 14 (July 16th)
- Test Freeze Week 16 (July 30th)
*** prow.cncf.io
- Created [[https://github.com/cncf-infra][github.com/cncf-infra]] org
- [[https://github.com/cncf-infra/prow-config][prow-config]] has two plugins
  - verify-conformance-release
  - verify-conformance-tests
- Test PRs in fork of [[https://github.com/cncf-infra/k8s-conformance/pulls][k8s-conformance]]
*** 14 + 18 Tested Endpoints released to Stable
+ Total of 32 Endpoints promoted from beta
+ With conformance test,by the community
+ [[https://github.com/kubernetes/kubernetes/pull/91685][#91685]] CertificateSigningRequestV1 API
+ [[https://github.com/kubernetes/kubernetes/pull/91996][#91996]] Ingress:CRUD API tests for v1 to conformance
  - **note links to [[https://apisnoop.cncf.io][APISnoop.cncf.io]]**
  - Shouts out to **[[https://github.com/liggitt][@liggitt]]**
*** 5.12% increase in coverage since April News
- All because Beta endpoints to GA
  - included all conformance tests!
- Current coverage: 40.82% = 180/450
- Previous coverage 35.70% = 146/409
*** Watch Tooling Refactoring
- Consensus was to [[https://github.com/kubernetes/kubernetes/pull/91416#issuecomment-645064347][merge ]]and iterate
- [[https://github.com/kubernetes/kubernetes/issues/90957][Issue #90957]] will continue discussion
- [[https://github.com/kubernetes/kubernetes/pull/92621/][PR #92621]] Simplify ConfigMap lifecycle e2e test by @spiffxp
  Under review as an alternative to Watch Tooling 
*** +29 Endpoints Backlogged by Tooling Requests
- [[https://github.com/kubernetes/kubernetes/issues/90957][Watch Tooling]] Summary
  - Initial Tooling Approach Merged! [[https://github.com/kubernetes/kubernetes/pull/91416#issuecomment-645064347][#91416]]
  - Existing Test PRs: +23
    - Promotion #90941 & #90939 (+6)
    - In progress #90942, #90988# #92589 (+17)
  - Triage 1 Issues: +6
*** Conformance coverage progress
- @liggitt merged 2 Conformance Test +32 Endpoints
- ii merged 2 Conformance Tests +8 Endpoints
- ii has 5 test open (4 PR's + 1 Issues) +29 Endpoints
  - dependant on Tooling Watch tooling (Potential + 6.83%)
- ii has 5 test indipendant of Watch tooling +20 Endpoints
*** Historical Endpoint and Conformance data
  - Two [[https://www.instantinfrastructure.com/snoop/][graphs]] have been prepared using the following underling data:
    - New [[https://github.com/kubernetes/kubernetes/blob/master/test/conformance/testdata/conformance.yaml][Conformance.yaml]]
    - 1.9-1.18 release tags for OpenAPI json
    - Latest release-blocking prow job audit.log
*** APISnoop updates
**** Generating yaml and json files for coverage to make it easier for other apps to consume
 - discussing this in [[https://github.com/kubernetes/kubernetes/pull/92631][pr 92631]], and last conformance office hours
 - will likely keep this out of tree, but usefulness of these files feels clear.
**** New snoop site using our output json files
  - [[https://snoop-app.vercel.app]] is preview of new site
  - pulls all data from github repo holding coverage info
    - can use similar process for prowbots and gates
  - improved routing (navigate via release instead of bucket and job)
  - conformance progress added as new page 
  - about page added with more info on our process and update frequency.
**** Discovered increase in coverage with Serial and Disruption tests
  - there are a set of conformance tests that were not included in the buckets we drew our testdata from.
  - these tests are being run in a a different e2e test run.
  - by combining the data sets, we can see all the conformance tests and which endpoints they hit.
  - doing this work uncovered 17 new endpoints hit by conformance tests.
  - this number is reflected in our new app and on the landing page of apisnoop.cncf.io
**** Next Up: automating the updates of our coverage jsons
**** Next Up: listing new, untested endpoints sorted by recency
** Gate cncf/k8s-conformance PRs
- [[https://github.com/cncf/apisnoop/projects/29][cncf/k8s-conformance project board]]
*** KR1 Setup prow.cncf.io
- [X] DNS prow.cncf.io pointing to prow.apisnoop.io
- [X] Grant cncf-ci bot permissions to cncf github org
- [X] Deploy prow onto prow.cncf.io
- [X] Researching the isolation / clusters used by test-infra / k8s-infra-wg
- [ ] Look into setting up #wg-cncf-infra if there is interest
*** KR2 Connect cncf/k8s-conformance to prow.cncf.io
- [X] Comments and admin actions from prow.cncf.io
- [X] Will be made using the [[https://github.com/cncf-ci][cncf-ci]] bot/github account.
- [X] Enable [[https://github.com/cncf/k8s-conformance/pull/971][meow]] and simple prow bot plugins
*** KR3 gate+comment
- Verify Release
  -[X] **release-X.Y**
  -[X] **needs-release** w/ Comments
- Verify Tests
  - **tests-run-X.Y**
  - **needs-tests** w/ Comments
*** Verify Release
- [X] PR Title
- [X] Folder
- [X] e2e.log
- [-] junit.xml
- [X] PRODUCT.yaml has all required fields
- [X] add **needs-release** OR **release-X.Y**
*** Verify Tests
- [X] List of tests required for release
- [ ] List of tests from junit.xml and compare with requiered test
- [ ] List of tests from e2e.log and compare to junit.xml
- [ ] Comment list/count of missing tests
- [ ] add **needs-tests** OR **tests-run-X.Y**
*** definition Informed by [[https://github.com/kubernetes/enhancements/blob/2c19ec7627e326d1c75306dcaa3d2f14002301fa/keps/sig-architecture/960-conformance-behaviors/README.md#role-cncf-conformance-program][user stories for KEP-960]]
#+begin_example
Must confirm the version of the tests being run matches...
Must confirm the set of tests being run matches...
Must confirm all behaviors are covered by a test...
#+end_example
** Gate k/k PRs touching test/e2e or API
- [[https://github.com/cncf/apisnoop/projects/30][k/k API+Conformance Gate]]
*** Background
    Influenced by [[https://github.com/kubernetes/enhancements/pull/1666/files?short_path=92a9412#diff-92a9412ae55358378bc66295cdbea103][Behavior KEP user stories]] while continuing to focus on endpoints!

 #+begin_quote
 Will show increase in endpoints, and tested endpoints, but also, explicitly, whether conformance coverage increased.
 #+end_quote

 #+begin_quote
 Comment: "you are adding a new endpoint to stable, and you are adding a conformance test for it"
 #+end_quote
*** OKing PR

#+begin_quote
Existing responsiblity via owners file ensures that PRs touching swagger or conformance tests are **/approved** by right people.
#+end_quote

#+begin_quote
A label of **requires-conformance** will applied, and **conformance** label will need to be added by this gate + automation.
#+end_quote
*** KR1 Identify a PR as requiring conformance review
PR must touch file in conformance-specific directory

- (initially /area-conformance + /sig-arch)
- [ ] Create ~run_if_changed~ presubmit

#+begin_example
eg: update test/conformance/behaviors/..
eg: mv from test/e2e to test/conformance
#+end_example
*** KR2 Identify list of endpoints added/removed
Tooling will compare ~path/operation_id~ in ~api/openapi-spec/swagger.json~
- [ ] Generate list of new endpoints
- [ ] Generate list of removed endpoints
*** KR3 Run APISnoop against PR to generate endpoint coverage
Tooling will provide a list of tested and conformant endpoints.
- [ ] Wait for main prow job to finish
- [ ] Generate list of hit/tested endpoints
- [ ] Generate list of conformant endpoints
*** KR4 bot comment w/ list of increase/decrease of endpoints
Tooling will comment directly on PR

- [ ] alpha : endpoints needing tests
- [ ] beta : endpoints needing tests
- [ ] stable : comment+block via tag

#+begin_quote
You've added api's without tests it will not be able to reach stable.
#+end_quote
*** KR5 Manual Approval for SIG-Arch (or appropriate owners)
Ensure the API Review process has been followed.

- [ ] Get feedback on approval process from SIG-Arch
- [ ] Ensure the correct tagging / OWNERS are respected
*** KR6 Donate APISnoop to sig-arch
- [ ] Get feedback if this is desired
- [ ] Get as to location of repo under k8s org
- [ ] Migration maybe in Q4
** Increase Stable Test Coverage by 40 endpoints
*** KR1 (8/40) new conformant stable endpoints
- #89753 + 5 points
- #90390 + 3 points
- #91416 Add watch event tooling
*** KR2 +9% Coverage Increase 36.46%->45.46%
Due to increase in total endpoints, our increase may be hidden.
Percentage many not be a clear indicator.
- 34.15%->38.30% => +3.85%
- 36.46%->38.30% => +1.84%
*** KR3 (stretch +49) 50% stable endpoints hit by conformance tests
- Possibly, but it will be a stretch
* Footnotes

#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
# #+REVEAL_TITLE_SLIDE:
#+NOREVEAL_DEFAULT_FRAG_STYLE: YY
#+NOREVEAL_EXTRA_CSS: YY
#+NOREVEAL_EXTRA_JS: YY
#+REVEAL_HLEVEL: 2
#+REVEAL_MARGIN: 0.1
#+REVEAL_WIDTH: 1000
#+REVEAL_HEIGHT: 600
#+REVEAL_MAX_SCALE: 3.5
#+REVEAL_MIN_SCALE: 0.2
#+REVEAL_PLUGINS: (markdown notes highlight multiplex)
#+REVEAL_SLIDE_NUMBER: ""
#+REVEAL_SPEED: 1
#+REVEAL_THEME: sky
#+REVEAL_THEME_OPTIONS: beige|black|blood|league|moon|night|serif|simple|sky|solarized|white
#+REVEAL_TRANS: cube
#+REVEAL_TRANS_OPTIONS: none|cube|fade|concave|convex|page|slide|zoom

#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: mathjax:Y
#+OPTIONS: reveal_single_file:nil
#+OPTIONS: reveal_control:t
#+OPTIONS: reveal-progress:t
#+OPTIONS: reveal_history:nil
#+OPTIONS: reveal_center:t
#+OPTIONS: reveal_rolling_links:nil
#+OPTIONS: reveal_keyboard:t
#+OPTIONS: reveal_overview:t
