org/roadmap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-02 Thu 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>APISnoop 1.19 OKRs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ii.coop" />
</head>
<body>
<div id="content">
<h1 class="title">APISnoop 1.19 OKRs</h1>

<div id="outline-container-org9fccff7" class="outline-2">
<h2 id="org9fccff7">v1.19</h2>
<div class="outline-text-2" id="text-org9fccff7">
<p>
Our goal is to not make radical changes to process or approach, but iterate on our working methods to increase velocity and output in a stable, consistent way.
</p>
</div>
<div id="outline-container-orgfa763d9" class="outline-3">
<h3 id="orgfa763d9">June News</h3>
<div class="outline-text-3" id="text-orgfa763d9">
</div>
<div id="outline-container-org19648de" class="outline-4">
<h4 id="org19648de">SIG-Release 1.19 <a href="https://github.com/kubernetes/sig-release/tree/master/releases/release-1.19#timeline">Timelines</a> due to Covid</h4>
<div class="outline-text-4" id="text-org19648de">
<ul class="org-ul">
<li>Dates <a href="https://groups.google.com/forum/?utm_medium=email&amp;utm_source=footer#!msg/kubernetes-dev/TVXhcNO3SPU/-Uj-xJP2BQAJ">may yet again slip</a>, not confirmed</li>
<li>Tests need to be in Week 14 (July 16th)</li>
<li>Test Freeze Week 16 (July 30th)</li>
</ul>
</div>
</div>
<div id="outline-container-org7609b2d" class="outline-4">
<h4 id="org7609b2d">prow.cncf.io</h4>
<div class="outline-text-4" id="text-org7609b2d">
<ul class="org-ul">
<li>Created <a href="https://github.com/cncf-infra">github.com/cncf-infra</a> org</li>
<li><a href="https://github.com/cncf-infra/prow-config">prow-config</a> has two plugins
<ul class="org-ul">
<li>verify-conformance-release</li>
<li>verify-conformance-tests</li>
</ul></li>
<li>Test PRs in fork of <a href="https://github.com/cncf-infra/k8s-conformance/pulls">k8s-conformance</a></li>
</ul>
</div>
</div>
<div id="outline-container-org38925bc" class="outline-4">
<h4 id="org38925bc">14 + 18 Tested Endpoints released to Stable</h4>
<div class="outline-text-4" id="text-org38925bc">
<ul class="org-ul">
<li>Total of 32 Endpoints promoted from beta</li>
<li>With conformance test,by the community</li>
<li><a href="https://github.com/kubernetes/kubernetes/pull/91685">#91685</a> CertificateSigningRequestV1 API</li>
<li><a href="https://github.com/kubernetes/kubernetes/pull/91996">#91996</a> Ingress:CRUD API tests for v1 to conformance
<ul class="org-ul">
<li><b><b>note links to <a href="https://apisnoop.cncf.io">APISnoop.cncf.io</a></b></b></li>
<li>Shouts out to <b><b><a href="https://github.com/liggitt">@liggitt</a></b></b></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgac249e6" class="outline-4">
<h4 id="orgac249e6">5.12% increase in coverage since April News</h4>
<div class="outline-text-4" id="text-orgac249e6">
<ul class="org-ul">
<li>All because Beta endpoints to GA
<ul class="org-ul">
<li>included all conformance tests!</li>
</ul></li>
<li>Current coverage: 40.82% = 180/450</li>
<li>Previous coverage 35.70% = 146/409</li>
</ul>
</div>
</div>
<div id="outline-container-org73352d3" class="outline-4">
<h4 id="org73352d3">Watch Tooling Refactoring</h4>
<div class="outline-text-4" id="text-org73352d3">
<ul class="org-ul">
<li>Consensus was to <a href="https://github.com/kubernetes/kubernetes/pull/91416#issuecomment-645064347">merge </a>and iterate</li>
<li><a href="https://github.com/kubernetes/kubernetes/issues/90957">Issue #90957</a> will continue discussion</li>
<li><a href="https://github.com/kubernetes/kubernetes/pull/92621/">PR #92621</a> Simplify ConfigMap lifecycle e2e test by @spiffxp
Under review as an alternative to Watch Tooling</li>
</ul>
</div>
</div>
<div id="outline-container-org4161739" class="outline-4">
<h4 id="org4161739">+29 Endpoints Backlogged by Tooling Requests</h4>
<div class="outline-text-4" id="text-org4161739">
<ul class="org-ul">
<li><a href="https://github.com/kubernetes/kubernetes/issues/90957">Watch Tooling</a> Summary
<ul class="org-ul">
<li>Initial Tooling Approach Merged! <a href="https://github.com/kubernetes/kubernetes/pull/91416#issuecomment-645064347">#91416</a></li>
<li>Existing Test PRs: +23
<ul class="org-ul">
<li>Promotion #90941 &amp; #90939 (+6)</li>
<li>In progress #90942, #90988# #92589 (+17)</li>
</ul></li>
<li>Triage 1 Issues: +6</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org687964e" class="outline-4">
<h4 id="org687964e">Conformance coverage progress</h4>
<div class="outline-text-4" id="text-org687964e">
<ul class="org-ul">
<li>@liggitt merged 2 Conformance Test +32 Endpoints</li>
<li>ii merged 2 Conformance Tests +8 Endpoints</li>
<li>ii has 5 test open (4 PR's + 1 Issues) +29 Endpoints
<ul class="org-ul">
<li>dependant on Tooling Watch tooling (Potential + 6.83%)</li>
</ul></li>
<li>ii has 5 test indipendant of Watch tooling +20 Endpoints</li>
</ul>
</div>
</div>
<div id="outline-container-org4de4f5a" class="outline-4">
<h4 id="org4de4f5a">Historical Endpoint and Conformance data</h4>
<div class="outline-text-4" id="text-org4de4f5a">
<ul class="org-ul">
<li>Two <a href="https://www.instantinfrastructure.com/snoop/">graphs</a> have been prepared using the following underling data:
<ul class="org-ul">
<li>New <a href="https://github.com/kubernetes/kubernetes/blob/master/test/conformance/testdata/conformance.yaml">Conformance.yaml</a></li>
<li>1.9-1.18 release tags for OpenAPI json</li>
<li>Latest release-blocking prow job audit.log</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd1e8e50" class="outline-4">
<h4 id="orgd1e8e50">APISnoop updates</h4>
<div class="outline-text-4" id="text-orgd1e8e50">
</div>
<ul class="org-ul">
<li><a id="orgc811537"></a>Generating yaml and json files for coverage to make it easier for other apps to consume<br />
<div class="outline-text-5" id="text-orgc811537">
<ul class="org-ul">
<li>discussing this in <a href="https://github.com/kubernetes/kubernetes/pull/92631">pr 92631</a>, and last conformance office hours</li>
<li>will likely keep this out of tree, but usefulness of these files feels clear.</li>
</ul>
</div>
</li>
<li><a id="org88bb1fe"></a>New snoop site using our output json files<br />
<div class="outline-text-5" id="text-org88bb1fe">
<ul class="org-ul">
<li><a href="https://snoop-app.vercel.app">https://snoop-app.vercel.app</a> is preview of new site</li>
<li>pulls all data from github repo holding coverage info
<ul class="org-ul">
<li>can use similar process for prowbots and gates</li>
</ul></li>
<li>improved routing (navigate via release instead of bucket and job)</li>
<li>conformance progress added as new page</li>
<li>about page added with more info on our process and update frequency.</li>
</ul>
</div>
</li>
<li><a id="orgad34204"></a>Discovered increase in coverage with Serial and Disruption tests<br />
<div class="outline-text-5" id="text-orgad34204">
<ul class="org-ul">
<li>there are a set of conformance tests that were not included in the buckets we drew our testdata from.</li>
<li>these tests are being run in a a different e2e test run.</li>
<li>by combining the data sets, we can see all the conformance tests and which endpoints they hit.</li>
<li>doing this work uncovered 17 new endpoints hit by conformance tests.</li>
<li>this number is reflected in our new app and on the landing page of apisnoop.cncf.io</li>
</ul>
</div>
</li>
<li><a id="orgde284d8"></a>Next Up: automating the updates of our coverage jsons<br /></li>
<li><a id="org0d482b2"></a>Next Up: listing new, untested endpoints sorted by recency<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org405982f" class="outline-3">
<h3 id="org405982f">Gate cncf/k8s-conformance PRs</h3>
<div class="outline-text-3" id="text-org405982f">
<ul class="org-ul">
<li><a href="https://github.com/cncf/apisnoop/projects/29">cncf/k8s-conformance project board</a></li>
</ul>
</div>
<div id="outline-container-org8b0cf1f" class="outline-4">
<h4 id="org8b0cf1f">KR1 Setup prow.cncf.io</h4>
<div class="outline-text-4" id="text-org8b0cf1f">
<ul class="org-ul">
<li class="on"><code>[X]</code> DNS prow.cncf.io pointing to prow.apisnoop.io</li>
<li class="on"><code>[X]</code> Grant cncf-ci bot permissions to cncf github org</li>
<li class="on"><code>[X]</code> Deploy prow onto prow.cncf.io</li>
<li class="on"><code>[X]</code> Researching the isolation / clusters used by test-infra / k8s-infra-wg</li>
<li class="off"><code>[&#xa0;]</code> Look into setting up #wg-cncf-infra if there is interest</li>
</ul>
</div>
</div>
<div id="outline-container-orgf76376b" class="outline-4">
<h4 id="orgf76376b">KR2 Connect cncf/k8s-conformance to prow.cncf.io</h4>
<div class="outline-text-4" id="text-orgf76376b">
<ul class="org-ul">
<li class="on"><code>[X]</code> Comments and admin actions from prow.cncf.io</li>
<li class="on"><code>[X]</code> Will be made using the <a href="https://github.com/cncf-ci">cncf-ci</a> bot/github account.</li>
<li class="on"><code>[X]</code> Enable <a href="https://github.com/cncf/k8s-conformance/pull/971">meow</a> and simple prow bot plugins</li>
</ul>
</div>
</div>
<div id="outline-container-org0759585" class="outline-4">
<h4 id="org0759585">KR3 gate+comment</h4>
<div class="outline-text-4" id="text-org0759585">
<ul class="org-ul">
<li>Verify Release
-[X] <b><b>release-X.Y</b></b>
-[X] <b><b>needs-release</b></b> w/ Comments</li>
<li>Verify Tests
<ul class="org-ul">
<li><b><b>tests-run-X.Y</b></b></li>
<li><b><b>needs-tests</b></b> w/ Comments</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgaa4b134" class="outline-4">
<h4 id="orgaa4b134">Verify Release</h4>
<div class="outline-text-4" id="text-orgaa4b134">
<ul class="org-ul">
<li class="on"><code>[X]</code> PR Title</li>
<li class="on"><code>[X]</code> Folder</li>
<li class="on"><code>[X]</code> e2e.log</li>
<li class="trans"><code>[-]</code> junit.xml</li>
<li class="on"><code>[X]</code> PRODUCT.yaml has all required fields</li>
<li class="on"><code>[X]</code> add <b><b>needs-release</b></b> OR <b><b>release-X.Y</b></b></li>
</ul>
</div>
</div>
<div id="outline-container-orgeb8d706" class="outline-4">
<h4 id="orgeb8d706">Verify Tests</h4>
<div class="outline-text-4" id="text-orgeb8d706">
<ul class="org-ul">
<li class="on"><code>[X]</code> List of tests required for release</li>
<li class="off"><code>[&#xa0;]</code> List of tests from junit.xml and compare with requiered test</li>
<li class="off"><code>[&#xa0;]</code> List of tests from e2e.log and compare to junit.xml</li>
<li class="off"><code>[&#xa0;]</code> Comment list/count of missing tests</li>
<li class="off"><code>[&#xa0;]</code> add <b><b>needs-tests</b></b> OR <b><b>tests-run-X.Y</b></b></li>
</ul>
</div>
</div>
<div id="outline-container-org856ced3" class="outline-4">
<h4 id="org856ced3">definition Informed by <a href="https://github.com/kubernetes/enhancements/blob/2c19ec7627e326d1c75306dcaa3d2f14002301fa/keps/sig-architecture/960-conformance-behaviors/README.md#role-cncf-conformance-program">user stories for KEP-960</a></h4>
<div class="outline-text-4" id="text-org856ced3">
<pre class="example">
Must confirm the version of the tests being run matches...
Must confirm the set of tests being run matches...
Must confirm all behaviors are covered by a test...
</pre>
</div>
</div>
</div>
<div id="outline-container-org00a4453" class="outline-3">
<h3 id="org00a4453">Gate k/k PRs touching test/e2e or API</h3>
<div class="outline-text-3" id="text-org00a4453">
<ul class="org-ul">
<li><a href="https://github.com/cncf/apisnoop/projects/30">k/k API+Conformance Gate</a></li>
</ul>
</div>
<div id="outline-container-orge4d6d9e" class="outline-4">
<h4 id="orge4d6d9e">Background</h4>
<div class="outline-text-4" id="text-orge4d6d9e">
<p>
Influenced by <a href="https://github.com/kubernetes/enhancements/pull/1666/files?short_path=92a9412#diff-92a9412ae55358378bc66295cdbea103">Behavior KEP user stories</a> while continuing to focus on endpoints!
</p>

<blockquote>
<p>
Will show increase in endpoints, and tested endpoints, but also, explicitly, whether conformance coverage increased.
</p>
</blockquote>

<blockquote>
<p>
Comment: "you are adding a new endpoint to stable, and you are adding a conformance test for it"
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgd7dafa5" class="outline-4">
<h4 id="orgd7dafa5">OKing PR</h4>
<div class="outline-text-4" id="text-orgd7dafa5">
<blockquote>
<p>
Existing responsiblity via owners file ensures that PRs touching swagger or conformance tests are <b><b>/approved</b></b> by right people.
</p>
</blockquote>

<blockquote>
<p>
A label of <b><b>requires-conformance</b></b> will applied, and <b><b>conformance</b></b> label will need to be added by this gate + automation.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orge3d061c" class="outline-4">
<h4 id="orge3d061c">KR1 Identify a PR as requiring conformance review</h4>
<div class="outline-text-4" id="text-orge3d061c">
<p>
PR must touch file in conformance-specific directory
</p>

<ul class="org-ul">
<li>(initially /area-conformance + /sig-arch)</li>
<li class="off"><code>[&#xa0;]</code> Create <code>run_if_changed</code> presubmit</li>
</ul>

<pre class="example">
eg: update test/conformance/behaviors/..
eg: mv from test/e2e to test/conformance
</pre>
</div>
</div>
<div id="outline-container-org543ed97" class="outline-4">
<h4 id="org543ed97">KR2 Identify list of endpoints added/removed</h4>
<div class="outline-text-4" id="text-org543ed97">
<p>
Tooling will compare <code>path/operation_id</code> in <code>api/openapi-spec/swagger.json</code>
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Generate list of new endpoints</li>
<li class="off"><code>[&#xa0;]</code> Generate list of removed endpoints</li>
</ul>
</div>
</div>
<div id="outline-container-org43dbe50" class="outline-4">
<h4 id="org43dbe50">KR3 Run APISnoop against PR to generate endpoint coverage</h4>
<div class="outline-text-4" id="text-org43dbe50">
<p>
Tooling will provide a list of tested and conformant endpoints.
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Wait for main prow job to finish</li>
<li class="off"><code>[&#xa0;]</code> Generate list of hit/tested endpoints</li>
<li class="off"><code>[&#xa0;]</code> Generate list of conformant endpoints</li>
</ul>
</div>
</div>
<div id="outline-container-orgf941258" class="outline-4">
<h4 id="orgf941258">KR4 bot comment w/ list of increase/decrease of endpoints</h4>
<div class="outline-text-4" id="text-orgf941258">
<p>
Tooling will comment directly on PR
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> alpha : endpoints needing tests</li>
<li class="off"><code>[&#xa0;]</code> beta : endpoints needing tests</li>
<li class="off"><code>[&#xa0;]</code> stable : comment+block via tag</li>
</ul>

<blockquote>
<p>
You've added api's without tests it will not be able to reach stable.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgb5bb18f" class="outline-4">
<h4 id="orgb5bb18f">KR5 Manual Approval for SIG-Arch (or appropriate owners)</h4>
<div class="outline-text-4" id="text-orgb5bb18f">
<p>
Ensure the API Review process has been followed.
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Get feedback on approval process from SIG-Arch</li>
<li class="off"><code>[&#xa0;]</code> Ensure the correct tagging / OWNERS are respected</li>
</ul>
</div>
</div>
<div id="outline-container-orgcfc50e6" class="outline-4">
<h4 id="orgcfc50e6">KR6 Donate APISnoop to sig-arch</h4>
<div class="outline-text-4" id="text-orgcfc50e6">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Get feedback if this is desired</li>
<li class="off"><code>[&#xa0;]</code> Get as to location of repo under k8s org</li>
<li class="off"><code>[&#xa0;]</code> Migration maybe in Q4</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcd35b5d" class="outline-3">
<h3 id="orgcd35b5d">Increase Stable Test Coverage by 40 endpoints</h3>
<div class="outline-text-3" id="text-orgcd35b5d">
</div>
<div id="outline-container-org9499d2c" class="outline-4">
<h4 id="org9499d2c">KR1 (8/40) new conformant stable endpoints</h4>
<div class="outline-text-4" id="text-org9499d2c">
<ul class="org-ul">
<li>#89753 + 5 points</li>
<li>#90390 + 3 points</li>
<li>#91416 Add watch event tooling</li>
</ul>
</div>
</div>
<div id="outline-container-orgc271bb0" class="outline-4">
<h4 id="orgc271bb0">KR2 +9% Coverage Increase 36.46%-&gt;45.46%</h4>
<div class="outline-text-4" id="text-orgc271bb0">
<p>
Due to increase in total endpoints, our increase may be hidden.
Percentage many not be a clear indicator.
</p>
<ul class="org-ul">
<li>34.15%-&gt;38.30% =&gt; +3.85%</li>
<li>36.46%-&gt;38.30% =&gt; +1.84%</li>
</ul>
</div>
</div>
<div id="outline-container-orgfc24bf9" class="outline-4">
<h4 id="orgfc24bf9">KR3 (stretch +49) 50% stable endpoints hit by conformance tests</h4>
<div class="outline-text-4" id="text-orgfc24bf9">
<ul class="org-ul">
<li>Possibly, but it will be a stretch</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ii.coop</p>
<p class="date">Created: 2020-07-02 Thu 21:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
